{
  "export_info": {
    "exported_at": "2025-10-08T20:52:52.075025+00:00",
    "total_jobs": 8,
    "filters_applied": {
      "source": null,
      "company": null,
      "location": null,
      "recent_days": null,
      "limit": null
    }
  },
  "jobs": [
    {
      "title": "Software Engineer, React",
      "company": {
        "name": "Ascension",
        "website": null,
        "email": null
      },
      "location": "Remote",
      "url": "https://www.glassdoor.com/job-listing/software-engineer-react-ascension-JV_KO0,23_KE24,33.htm?jl=1009900152311",
      "description": "DetailsDepartment:Growth Marketig & Digital Experience (GMDx)Schedule:Monday - Friday, 8 hour shiftLocation:RemoteSalary:$100,218 - $139,698BenefitsPaid time off (PTO)Various health insurance options & wellness plansRetirement benefits including employer match plansLong-term & short-term disabilityEmployee assistance programs (EAP)Parental leave & adoption assistanceTuition reimbursementWays to give back to your communityBenefit options and eligibility vary by position. Compensation varies based on factors including, but not limited to, experience, skills, education, performance, location and salary range at the time of the offer.ResponsibilitiesAscension Technologies is at the forefront of revolutionizing healthcare technology nationwide. We bridge the gap between clinicians and patients, transforming their interaction with technology, thereby bolstering our ability to serve communities with heightened agility and responsiveness.Our associates harness the power of technology to foster collaborative solutions, significantly enhancing daily health decisions. Our independent software development teams labor tirelessly, ensuring our greenfield technology is meticulously constructed from the ground up, setting new standards for industry excellence.We advocate for a compassionate and just society through our actions, words, and innovative software solutions. Our mission is to support this cause, and we remain committed to developing software solutions that embody this ethos.Your Role:As a React Developer, you will play a crucial role in designing, developing, and maintaining high-quality software solutions using React. Working closely with our experienced development team, you will have the opportunity to learn and grow your skills while contributing to the development of cutting-edge software products.Key Responsibilities:Front-End Development:Assist in the design, development, and maintenance of scalable, efficient, and user-friendly web applications using React.Collaborative Development:Work collaboratively with senior developers and cross-functional teams to contribute to the development of innovative software solutions that align with business goals.UI/UX Design:Collaborate with designers and ensure the implementation of responsive and visually appealing user interfaces.Code Review and Quality Assurance:Participate in code reviews to ensure adherence to coding standards, best practices, and quality guidelines. Perform testing to identify and fix bugs or issues.API Integration:Assist in integrating front-end applications with RESTful APIs and backend services to enable seamless data exchange and functionality.Learning and Growth:Stay updated with the latest trends, technologies, and best practices in React development. Take initiatives to learn new skills and enhance your expertise.Essential Qualifications:To succeed in this role, you should possess the following qualifications:Solid understanding of JavaScript and familiarity with TypeScript.Basi... [truncated]",
      "source": "Glassdoor",
      "scraped_at": "2025-10-08T20:43:06.520055+00:00",
      "created_at": "2025-10-08T20:43:06.523973+00:00",
      "updated_at": "2025-10-08T20:43:06.524031+00:00"
    },
    {
      "title": "Software Engineer",
      "company": {
        "name": "Workiva",
        "website": null,
        "email": null
      },
      "location": "Remote",
      "url": "https://www.glassdoor.com/job-listing/software-engineer-workiva-JV_KO0,17_KE18,25.htm?jl=1009900409882",
      "description": "Analyzes, designs, programs, debugs and modifies software enhancements and/or new products used in local, networked, cloud-based or Internet-related computer programs. Code may be used in commercial or end-user applications, such as materials management, financial management, HRIS, mobile apps or desktop applications products. Using current programming language and technologies, writes code, completes programming and performs testing and debugging of applications. Completes documentation and procedures for installation and maintenance. May interact with users to define system requirements and/or necessary modifications. This job should be matched by companies that develop applications software. Companies that have both applications and systems software engineers and cannot identify them by function should match to Software Development Engineer (EN.SODE). Software development engineers using common development methodologies including Waterfall and Agile should be matched to our software development engineering roles. Employees focused on ensuring products (including websites) and hosted networks are designed and developed to be cyber-safe and compliant are typically matched to one of our software development engineering roles. For cloud databases, may be matched to Data Management - Storage Engineer (TE.DMSE) or for hosted networks, to Network Engineering (TE.INNE) or Network Systems Administration (TE.INNS). Employees focused on administering and hardening internal processes and systems against outside penetration and attack, match to Information Security (TE.ICIO).ScopeContributes to individual success by supporting established business processesProblem SolvingWorks on routine problems of a straightforward natureRequired to solve problems and investigate issues by analyzing situations or data following applicable procedureFollows common procedures to complete standardized assignmentsDiscretion and ImpactHas limited impact on own work teamExercises limited judgment within defined proceduresCollaboration and InteractionBegins to interact with high-level individual contributors within own areaBegins to build stable internal working relationships across own areaAutonomyReceives detailed instructions from supervisor or senior team member, completing work through defined procedures aligned to objectivesKnowledgeBasic knowledge of theories, technologies and concepts that underpin own disciplineAcquiring experience in applying practical techniques to resolve routine issuesDoes not require any previous professional experience, however, typically requires a Bachelor’s degree or equivalent work experienceHow You’ll Be Rewarded✅ Salary range in the US: $64,000.00 - $102,000.00✅ A discretionary bonus typically paid annually✅ Restricted Stock Units granted at time of hire✅ 401(k) match and comprehensive employee benefits packageThe salary range represents the low and high end of the salary range for this job in the US. Minimums and maximums may vary based on ... [truncated]",
      "source": "Glassdoor",
      "scraped_at": "2025-10-08T20:43:06.507479+00:00",
      "created_at": "2025-10-08T20:43:06.511481+00:00",
      "updated_at": "2025-10-08T20:43:06.511505+00:00"
    },
    {
      "title": "Software Engineer II",
      "company": {
        "name": "Live Nation",
        "website": null,
        "email": null
      },
      "location": "Beverly Hills, CA",
      "url": "https://www.glassdoor.com/job-listing/software-engineer-ii-live-nation-JV_IC1146753_KO0,20_KE21,32.htm?jl=1009900466930",
      "description": "Job Summary:Software Engineer II (Live Nation Worldwide, Inc.; Beverly Hills , CA ): Design, develop, implement, support, and maintain complex Java applications. Apply object-oriented analysis and design (OOAD), using industry best practices and techniques . Create technical specifications for detailed application designs. Troubleshoot and resolve software-related issues. Maintain code quality through unit testing. Document code appropriately for maintainability. Conduct design and code reviews to ensure design principles are followed. Create and maintain user-interface patterns and standards library. Collaborate with team members throughout the product lifecycle. Participate in team meetings to brainstorm and develop solutions. Understand the ticketing business to identify opportunities for resale technology to reach more fans. Adapt to a competitive environment by delivering solutions that meet and exceed customer expectations. Telecommuting anywhere in the U.S. permitted.Salary: $133,366 per year",
      "source": "Glassdoor",
      "scraped_at": "2025-10-08T20:43:06.483218+00:00",
      "created_at": "2025-10-08T20:43:06.491091+00:00",
      "updated_at": "2025-10-08T20:43:06.491175+00:00"
    },
    {
      "title": "Senior Associate, Sales Analytics",
      "company": {
        "name": "LinkedIn",
        "website": null,
        "email": null
      },
      "location": "San Francisco, CA",
      "url": "https://www.linkedin.com/jobs/view/senior-associate-sales-analytics-at-linkedin-4312325073?position=3&pageNum=0&refId=Aq3EzxTKj11sjSr7vH18rA%3D%3D&trackingId=m3o%2BC49tqHZ1pzNweEar7A%3D%3D",
      "description": "Company Description LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed. Join us to transform the way the world works. Job Description At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team. This role can be based in either our New York, Chicago, San Francisco, Sunnyvale, or Omaha offices. The ideal candidate will have strong SQL skills to be able to develop, maintain, and improve current data assets. The candidate will use strong analytical skills and be adept at deriving, distilling and articulating actionable business insights from large amounts of data. The Senior Associate, Sales Analytics will effectively collaborate and communicate with a variety of people and job functions, accomplishing tasks of high complexity and scope, and have the ability to perform professionally in a challenging and extremely fast-paced environment. They will contribute to building and maintaining the data environment, and building and enabling solutions for Sales Operations. This role is ideal for those passionate about creating and enhancing robust data systems supporting LinkedIn’s global operational analytics, with a focus on skills including SQL, Spark, and advanced analytics techniques. The work in this role will involve complex analytics initiatives across LinkedIn Talent Solutions and LinkedIn Sales Solutions, ensuring a stable and scalable foundation for every data-driven endeavor. The role emphasizes close collaboration with business leaders, Engineering, Sales and Operations teams to ensure project success and efficient, effective delivery of data insights at the right moments. Responsibilities : Leverage LinkedIn’s unique data to create innovative analyses & dashboards, including developing/deploying predictive models (e.g., forecasting and classification) Write SQL/Python queries to extract necessary data, analyze the results to generate actionable insights and present the findings Collaborate closely with the sales, marketing, engineering and data teams to provide analysis, reporting and tools that inform key stakeholders. Build cross-functional relationships and partner effectively with other teams to drive project success. Make business recommendations, conveying findings at multiple levels including managers and peers through visual dis... [truncated]",
      "source": "LinkedIn",
      "scraped_at": "2025-10-08T20:41:54.106454+00:00",
      "created_at": "2025-10-08T20:41:54.109303+00:00",
      "updated_at": "2025-10-08T20:41:54.109320+00:00"
    },
    {
      "title": "Sales Strategy and Operations Associate",
      "company": {
        "name": "LinkedIn",
        "website": null,
        "email": null
      },
      "location": "Singapore, Singapore",
      "url": "https://sg.linkedin.com/jobs/view/sales-strategy-and-operations-associate-at-linkedin-4312320525?position=2&pageNum=0&refId=Aq3EzxTKj11sjSr7vH18rA%3D%3D&trackingId=b5xx2icHPlEnNinI1SOHGQ%3D%3D",
      "description": "Company Description At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team. The Sales Strategy and Operations team builds and maintains the operational foundation that enables the LinkedIn Talent Solutions (LTS) sales organisation to run effectively and efficiently. This role will involve partnering with seniorsales executives to assess business performance and derive actionable insights focused on delivering revenue growth, sales productivity and customer value. The Senior Associate will lead, execute and scale operational andplanning processes in partnership with cross-functional stakeholders. This role offers an exciting opportunity to influence the trajectory of LTS, interact with LinkedIn’s most senior sales professionals and lead projects with key stakeholders and cross functional partners to make data-driven decisions. Job Description Responsibilities Partner with senior sales leadership to drive and support operational and analytical needs to assess and review business performance (rep productivity, forecasting, QBRs, product mix analysis) Support our global strategic planning process by leading planning work streams in areas such as customer segmentation, headcount, financial planning, go-to-market strategy, territory planning, book building and quota setting Lead operational processes of the sales organisation such as quota management, territory allocation, audits, reports and dashboard development, data checks and maintenance Lead and provide recommendations on a variety of strategic, cross-functional projects that will shape LinkedIn’s go-to-market motion Present insights and recommendations to executives and global sales operations partners Establish strong working relationships with peers in other sales operations teams and cross functional partners (business operations, sales leadership, HR, finance and systems teams) to achieve objectives Qualifications Basic Qualifications 4+ years of experience in sales, strategy and operations, management consulting, finance, sales operations, business operations or an analytical/operational role 4+ years of experience with Excel, PowerPoint and/or SQL Preferred Qualifications Advanced knowledge of Microsoft Excel Expertise in data analysis and financial modeling Comfort with ambiguity Experience in communicating effectively and presenting to senior executives Ability to build strong partnerships and collaborate with stakeholders Strong organisational skills and extremely high attention to detail Experience in working with Tableau, SQL and/or Presto, Anaplan Motivation to challenge that status quo and continually innovate Suggested Skills Excel SQL Collaboration Additional Information Global Data Privacy Notice for Job Candida... [truncated]",
      "source": "LinkedIn",
      "scraped_at": "2025-10-08T20:41:54.096889+00:00",
      "created_at": "2025-10-08T20:41:54.098917+00:00",
      "updated_at": "2025-10-08T20:41:54.098933+00:00"
    },
    {
      "title": "Senior Associate, Sales Analytics",
      "company": {
        "name": "LinkedIn",
        "website": null,
        "email": null
      },
      "location": "New York, NY",
      "url": "https://www.linkedin.com/jobs/view/senior-associate-sales-analytics-at-linkedin-4312325072?position=1&pageNum=0&refId=Aq3EzxTKj11sjSr7vH18rA%3D%3D&trackingId=Glrg3%2F1onL%2FScf7QPPrScg%3D%3D",
      "description": "Company Description LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed. Join us to transform the way the world works. Job Description At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team. This role can be based in either our New York, Chicago, San Francisco, Sunnyvale, or Omaha offices. The ideal candidate will have strong SQL skills to be able to develop, maintain, and improve current data assets. The candidate will use strong analytical skills and be adept at deriving, distilling and articulating actionable business insights from large amounts of data. The Senior Associate, Sales Analytics will effectively collaborate and communicate with a variety of people and job functions, accomplishing tasks of high complexity and scope, and have the ability to perform professionally in a challenging and extremely fast-paced environment. They will contribute to building and maintaining the data environment, and building and enabling solutions for Sales Operations. This role is ideal for those passionate about creating and enhancing robust data systems supporting LinkedIn’s global operational analytics, with a focus on skills including SQL, Spark, and advanced analytics techniques. The work in this role will involve complex analytics initiatives across LinkedIn Talent Solutions and LinkedIn Sales Solutions, ensuring a stable and scalable foundation for every data-driven endeavor. The role emphasizes close collaboration with business leaders, Engineering, Sales and Operations teams to ensure project success and efficient, effective delivery of data insights at the right moments. Responsibilities : Leverage LinkedIn’s unique data to create innovative analyses & dashboards, including developing/deploying predictive models (e.g., forecasting and classification) Write SQL/Python queries to extract necessary data, analyze the results to generate actionable insights and present the findings Collaborate closely with the sales, marketing, engineering and data teams to provide analysis, reporting and tools that inform key stakeholders. Build cross-functional relationships and partner effectively with other teams to drive project success. Make business recommendations, conveying findings at multiple levels including managers and peers through visual dis... [truncated]",
      "source": "LinkedIn",
      "scraped_at": "2025-10-08T20:41:54.083320+00:00",
      "created_at": "2025-10-08T20:41:54.089931+00:00",
      "updated_at": "2025-10-08T20:41:54.089976+00:00"
    },
    {
      "title": "Software Developer",
      "company": {
        "name": "PureStryk Golf",
        "website": null,
        "email": null
      },
      "location": "Hybrid work in Mineola, NY 11501",
      "url": "https://www.indeed.com/rc/clk?jk=f2cfe040591a6697&bb=_fhXXxYdGLTJjPPi_gQqzWrIroCg-xx2aWOLtrw0dyi8kliGeyYugUX_LU6sPaBZYDyDhXpR3MMiQGXw-V2PRjcUW7hlJVAoewU3s9UnNyulGRL1UTtNxB7WsLmBo_0c8GVaZXoQxawWmvJfRy8Yc-fEP3YR1JBW&xkcb=SoCF67M3si5-D4AOkj0KbzkdCdPP&fccid=947e18586bee5e6f&cmp=PureStryk-Golf&ti=Software+Engineer&vjs=3",
      "description": "PureStryk AI is redefining golf throughAI-powered instruction,real-time swing analysis, andimmersive coaching experiences.We’re hiring aTech Managerto oversee daily software operations, manage overseas dev teams, and code new features that bring our AI vision to life.You’ll:Manage and scale our AI software platformOversee global dev team + sprint executionBuild features like live swing feedback, recap automation & 3D visualsIntegrate with hardware (TrackMan, sensors, cameras)Develop backend infrastructure (AWS/Firebase) & QAJob Types: Full-time, Part-timeWork Location: Hybrid remote in Mineola, NY 11501",
      "source": "Indeed",
      "scraped_at": "2025-10-08T20:41:24.811683+00:00",
      "created_at": "2025-10-08T20:41:24.814834+00:00",
      "updated_at": "2025-10-08T20:41:24.814869+00:00"
    },
    {
      "title": "Senior Software Engineer, Frontend and AI",
      "company": {
        "name": "MongoDB",
        "website": null,
        "email": null
      },
      "location": "New York, NY 10019(Midtown area)",
      "url": "https://www.indeed.com/rc/clk?jk=73ca58e2ff0f044b&bb=_fhXXxYdGLTJjPPi_gQqzevwf7JqsvNr9jzYD0N8JfdV2Coey9QcYIYhh8vqG7_8wjkwbrwvQabFyTv6TwlJtWbEqN4Sd5gKz0s9plJP7z5M8fiKZhG26u8ftKyz8Ryvbbq8fPVLSVBODfPM65FO7w%3D%3D&xkcb=SoAx67M3si5-D4AOkj0LbzkdCdPP&fccid=5c80575a010bbc63&vjs=3",
      "description": "MongoDB's mission is to empower innovators to create, transform, and disrupt industries by unleashing the power of software and data. We enable organizations of all sizes to easily build, scale, and run modern applications by helping them modernize legacy workloads, embrace innovation, and unleash AI. Our industry-leading developer data platform, MongoDB Atlas, is the only globally distributed, multi-cloud database and is available in more than 115 regions across AWS, Google Cloud, and Microsoft Azure. Atlas allows customers to build and run applications anywhere—on premises, or across cloud providers. With offices worldwide and over 175,000 new developers signing up to use MongoDB every month, it's no wonder that leading organizations, like Samsung and Toyota, trust MongoDB to build next-generation, AI-powered applications.Join the DevProd TeamThe Developer Productivity team empowers more than a thousand engineers across MongoDB through our continuous integration system, Evergreen. Evergreen runs 300 million tests across 400 thousand hosts per day, keeping engineers moving quickly and confidently. You'll be working on Spruce, our frontend interface for Evergreen, and Parsley, our high-performance log viewer. Spruce helps engineers visualize data and evaluate CI builds, while Parsley can smoothly render gigabytes of log data directly in the browser.We're also investing in Sage, a specialized backend service for building AI agents to help engineers debug tasks. Written in TypeScript, Sage is part of our push to bring AI-powered tooling to the heart of our developer productivity ecosystem.You'll be joining a team of talented engineers who are passionate about building reliable, scalable, and cutting-edge tools. The products you work on — Spruce, Parsley, and Sage — are used daily by over 1 thousand engineers at MongoDB to build and ship the features our customers rely on.We are looking to speak to candidates who are based in New York City for our hybrid working model.What You'll DoDesign, build, and optimize web applications in React, GraphQL, and TypeScript, focusing on performance and user experienceLead development on Spruce and Parsley, delivering data-rich, highly interactive experiences that scale to massive CI workloadsCollaborate with backend engineers working in Go and TypeScript to build seamless integrations between frontend and backend servicesContribute to Sage, developing AI-powered agentic flows that help engineers debug tasks more effectivelyEnsure best practices in testing (Cypress), monitoring, and reliabilityMentor team members and help shape the technical and cultural direction of our teamWhat You Bring to the Table5+ years of strong experience in React and TypeScriptExperience working with backend systems (experience in a statically typed compiled language like Go is a plus)Interest in developing agentic services and working with AI-powered developer toolingTrack record of designing and implementing performant, large-scale web ... [truncated]",
      "source": "Indeed",
      "scraped_at": "2025-10-08T20:41:24.791721+00:00",
      "created_at": "2025-10-08T20:41:24.800271+00:00",
      "updated_at": "2025-10-08T20:41:24.800328+00:00"
    }
  ]
}