[
  {
    "title": "Python Developer",
    "company": "Amatriot Group, LLC",
    "location": "Remote",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-amatriot-group-llc-JV_KO0,16_KE17,35.htm?jl=1009895846783",
    "description": "Senior Python Developer(Remote – Federal Project)Location:Remote (Must reside in the Continental U.S.)Clearance Required:U.S. Citizen; Must be eligible for VA Public TrustClient:U.S. Department of Veterans AffairsTarget Salary:$115,000 – $150,000 annual salaryPosition OverviewThe Amatriot Group is seeking aSenior Python Developerto support a critical modernization effort with theDepartment of Veterans Affairs (VA). Under the VICCS program, this role focuses on the redesign of a central application used for processing veterans’ benefits claims.This is aback-end heavy, senior-levelrole requiring8+ years of experiencein professional software development. Candidates must have strong expertise inPythonandDjango, along with demonstrated experience designing and building scalable, maintainable enterprise-grade applications.Key ResponsibilitiesLead the development and modernization of a legacy VA application using Python and DjangoArchitect, design, and maintain secure, scalable back-end servicesWork closely with front-end developers, DevOps, and product owners to integrate and deliver full-stack functionalityParticipate in sprint planning, architecture reviews, and code reviewsEnsure high-quality deliverables and adherence to VA software development standardsProvide technical mentorship to junior developers as neededRequired QualificationsU.S. Citizenship and ability to obtain VA Public Trust clearance8+ years of professional experiencein software developmentExpert-level proficiency inPythonandDjangoStrong understanding of RESTful API design and back-end systems integrationExperience with relational databases (PostgreSQL, MySQL, or similar)Background in building scalable, secure, and maintainable systemsFamiliarity with Agile/Scrum development practicesPreferred QualificationsExperience with front-end frameworks such asAngularorReact(a plus, but not required)Prior experience supporting federal agencies, particularly the VAKnowledge of Docker, Kubernetes, and CI/CD toolsExperience in system modernization or legacy system migration",
    "source": "Glassdoor",
    "company_website": null,
    "company_email": null,
    "scraped_at": "2025-10-05T01:48:59.851052"
  },
  {
    "title": "S#5481 C#/Python Developer",
    "company": "Corporate Systems Associates, Inc.",
    "location": "Remote",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/s-5481-c-python-developer-corporate-systems-associates-inc-JV_KO0,25_KE26,58.htm?jl=1009897008668",
    "description": "Job ID: S#5481 - C#/Python DeveloperPLEASE NOTE: This is a 3 month contract to hireand needs to meet Client full-time conversion policies. Those dependent on a work permit sponsor now or anytime in the future (ie H1B, OPT, CPT, etc) do not meet Client requirements for this opening.1. What’s the major objective(s) of the role?Full stack C# Developer (Mostly C# on the backend)Highly skilled developer with experience in C#, AWS Python, T-SQL, PostgreSQL to build Modern Rest APIs and database solutions.Healthcare or Dental or Provider Portal related experienced candidates will be first to be interviewed2. What are theMUST-HAVEtechnologies for this position?1. C# is primary skill + some AWS/ Python2. T-SQL and/or PostgreSQL and SSIS3. AWS4. Azure DevOps3. What are the MUST HAVECritical Skills for this position?1. API development using C#, Python, T-SQL, PostgreSQL2. Develop scalable high-performance application3. Experience in integrating multiple technologies.4. Ensuing efficiency, security and maintainability4. What are the NICE TO HAVEtechnologies?1. AWS2. C#, Python, T-SQL, PostgreSQL3. Azure DevOps, Build, Release, Setup Pipeline.4. Agile/Scrum development experience.Responsibilities:· Responsible for the technical / systems analysis, design, development, unit testing, system integration testing, implementation and support of software applications, using existing and emerging technology platforms.· Collaborating with IT, work with the business to obtain the necessary clarity of the requirements at a function point context.· Work with project managers, sponsors and other stakeholders to develop and plan technical strategies, agree upon project priorities and deliver applications that support business requirements. Also responsible for the Systems integration testing of applications prior to code release to Quality Assurance.· Provides functional / technical leadership to own team and to other teams· Leads end to end delivery of highly complex / multiple domains· Self-sufficient and Oversees implementation for entire area· Works on multiple large or complex projects.· Makes technical decisions· Manages complex intergroup issues and resolutions· Articulates and communicates the overall solution.· Technical consultant/ mentor within own group and to other technical groups· Approves technical and functional documentation.· Understands impact of integrating third party solutions to overall systems architecture.· Directs process for determining Deliverables, resources, and schedules· Ensures that technical components adhere to technical standards and guidelines· Active participant at technology forums.· Defines resource requirements and allocations, monitors and improves quality, and ensures 'best practice' development techniques.· Directs, motivates and develops staff, maximizing their individual contribution and their ability to function effectively with their team.· Works closely with client departments in development and implementation of applicatio... [truncated]",
    "source": "Glassdoor",
    "company_website": null,
    "company_email": null,
    "scraped_at": "2025-10-05T01:48:59.851315"
  },
  {
    "title": "Python Developer",
    "company": "BayOne",
    "location": "Sunnyvale, CA",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-bayone-JV_IC1147442_KO0,16_KE17,23.htm?jl=1009897225758",
    "description": "Python Developer",
    "source": "Glassdoor",
    "company_website": "https://bayone.com",
    "company_email": null,
    "scraped_at": "2025-10-05T01:48:59.851581"
  },
  {
    "title": "Backend developer - python",
    "company": "JSR Tech Consulting",
    "location": "Newark, NJ",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/backend-developer-python-jsr-tech-consulting-JV_IC1126906_KO0,24_KE25,44.htm?jl=1009896935379",
    "description": "Long term contract with a major financial client.Hybrid, 3 days/week in Newark, NJ.Pay rate 70 - 80 per hour.Looking for a lead developer with strong python, AWS and React experience",
    "source": "Glassdoor",
    "company_website": "https://www.jsrtechconsulting.com",
    "company_email": "07016phone908-287-5222emailinfo@jsrtechconsulting.comjobsif",
    "scraped_at": "2025-10-05T01:48:59.851832"
  },
  {
    "title": "Python Developer",
    "company": "Scalable Systems",
    "location": "Charlotte, NC",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-scalable-systems-JV_IC1138644_KO0,16_KE17,33.htm?jl=1009891566046",
    "description": "Job Title: Python DeveloperLocation: Charlotte NC (Hybrid)Duration: 12+ Months ContractRequired Experience/Skills:· Advanced proficiency in Python and SQL· REST API development· Power BI expertise· Experience in large corporate environments and cloud platforms· Familiarity with Agile/Scrum methodologies· Proven ability to work independentlyHighly Desired:· Oracle and PL/SQL· Microsoft SQL Server· PySpark· GenAI implementation experienceDesired:· S3-compatible storage (e.g., NetApp)· Dremio· Experience with accounting systemsJob Type: ContractPay: $53.75 - $56.00 per hourExperience:Python: 4 years (Preferred)SQL: 4 years (Preferred)REST API development: 4 years (Preferred)Power BI: 3 years (Preferred)Agile/Scrum methodologies: 3 years (Preferred)Generative AI: 2 years (Preferred)Work Location: In person",
    "source": "Glassdoor",
    "company_website": null,
    "company_email": null,
    "scraped_at": "2025-10-05T01:48:59.852079"
  },
  {
    "title": "Python Developer",
    "company": "Sajix",
    "location": "Pleasanton, CA",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-sajix-JV_IC1147390_KO0,16_KE17,22.htm?jl=1009896412204",
    "description": "InternCompany DescriptionSajix Inc.is a global health-tech company headquartered in Pleasanton, California, focused on transforming healthcare delivery through advanced digital solutions. Since its founding in 2006, Sajix has specialized in developing integrated healthcare information systems that streamline clinical, financial, and administrative operations for healthcare organizations around the world.With operations in the United States, United Kingdom, Singapore, and India, Sajix serves clients across North America, Europe, Asia, and Africa. Its flagship platform,iHelix, is a modular, scalable solution designed for use in diverse healthcare settings—from single-doctor practices to large hospital networks.Sajix offers a comprehensive suite of digital healthcare solutions, including:iHelixLifeeazyAI-based Revenue Cycle Management– optimizing financial workflows through automationAll products are built with global standards in mind, supporting multiple languages and currencies, and comply with international healthcare regulations such as CCR and CCD.Through strategic partnerships and a commitment to innovation, Sajix continues to lead the industry in delivering intelligent, interoperable, and patient-centric healthcare solutions.Website:www.sajix.comJob DescriptionAbout the Role:As a Python Developer Trainee at Sajix, you will work with our engineering team to develop backend services, automation scripts, and data processing modules that support our health-tech platforms.Key Responsibilities:Assist in writing clean and efficient Python code for backend services.Collaborate with data and DevOps teams to integrate applications.Write unit tests and support debugging and troubleshooting.Learn to use frameworks such as Django or FastAPI.QualificationsRequirements:Bachelor’s in Computer Science or related field.Proficiency in Python and knowledge of OOP principles.Familiarity with Git and REST APIs.Additional InformationThese trainee roles are offered in collaboration with Sajix’s__init__pyprogram—a structured, hands-on learning initiative aimed at nurturing the next generation of full-stack developers and technology professionals. The program offers tiered training tracks.Participants gain real-world experience through live projects, personalized mentorship, and exposure to industry-relevant tools and practices. This collaboration ensures that trainees are well-equipped with practical skills and knowledge to excel in their roles.For more information about the __init__py program, visit initpy.sajix.com.",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.852319"
  },
  {
    "title": "Full Stack Developer",
    "company": "McFadyen Digital",
    "location": "Vienna, VA",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/full-stack-developer-mcfadyen-digital-JV_IC1130417_KO0,20_KE21,37.htm?jl=1009896021033",
    "description": "Company DescriptionMcFadyen Digital is the leading advisor and implementer of eCommerce Marketplace solutions. During 15 years of implementing marketplaces, we’ve built dozens of platforms that cumulatively generate billions of dollars of gross merchandise value (GMV). We’re honored to have supported 10% of the Fortune 500 with their digital marketplace initiatives. Over 250 global brands like ABB, AB InBev, ACCO, Albertsons, American Red Cross, American Eagle Outfitters, US Army, US Agriculture Dept, (and many more) have entrusted their digital transformations to McFadyen. We operate global offices across the US, Brazil, and India. McFadyen Digital has been a trusted employer for over 37 years and believes that people are the most important part of our company. We’re proud of our Great Place to Work certification.Learn more about us at our website: www.mcfadyen.comJob DescriptionAre you an innovative person? Do you have a passion for technology and solving problems? Are you self-directed, confident, and able to work without requiring a great deal of structure or supervision? Are you highly self-motivated and have a head full of ideas? If you answered yes to these questions, we want to talk to you!!You will work with related technologies such as NodeJS, Java API, GIT, HTML, CSS, and JavaScript. Your expertise in all phases of a project's lifecycle from analysis to development will help you continue to build and deliver world-class systems.As a Full-Stack Developer, you will help integrate and customize marketplace and eCommerce products for our clients combining several platforms into an efficient and unified solution. Business needs must be translated into effective technical solutions using several core technologies including web applications from Shopify and other platforms.100% remote workResponsibilitiesTop 5 ResponsibilitiesAble to solve the critical issues related to front-end and back-end.Accurately translate web designs into elegant digital experiencesAble to translate business requirements into lean code.Experience as a Full-Stack developer so you can be actively involved in coding.Ability to transfer knowledge to other programmers.Other responsibilitiesShould have excellent communication skills.Work in a coordinated and frictionless way with distributed teams.Work alongside local and remote team members.Self-starter with the drive and passion to learn new tools, languages, and frameworks.Development experience under an agile development methodology and process.Experience using tools Jira, Git, AWS Platform.Writing server-side code using languages like Python, Java, or Node.js, managing databases, and building APIs.Contributing to the overall software architecture, testing, and troubleshooting of applications.Working with other developers, designers, and departments to deliver projects.QualificationsTop 5 qualificationsJavaScriptNode.jsPHPAWSDevOps/CI/CD toolsOther QualificationsProgramming Languages: Python, JavaScript, Java, Node.Fron... [truncated]",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.852561"
  },
  {
    "title": "Full Stack Java Developer",
    "company": "The Cervantes Group",
    "location": "Osco, IL",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/full-stack-java-developer-the-cervantes-group-JV_IC1129076_KO0,25_KE26,45.htm?jl=1009894472414",
    "description": "We are seeking a talented Full Stack Developer to join our dynamic team. The ideal candidate will possess a strong foundation in both front-end and back-end development, with experience in various programming languages and frameworks. This role involves designing, developing, and maintaining web applications while collaborating with cross-functional teams to deliver high-quality software solutions.DutiesDesign and implement scalable web applications using Ruby on Rails, JavaScript, and React Express.Develop RESTful APIs to facilitate communication between front-end and back-end systems.Collaborate with UX/UI designers to create user-friendly interfaces and enhance user experience.Manage databases using MySQL and SQL, ensuring data integrity and security.Utilize version control systems like Git and SVN for code management and collaboration.Participate in Agile development processes, contributing to sprint planning, reviews, and retrospectives.Conduct code reviews to maintain high coding standards and best practices.Troubleshoot and debug applications to optimize performance and resolve issues.Stay updated with emerging technologies and industry trends to continuously improve development practices.SkillsProficiency in IT infrastructure management and application development.Strong knowledge of programming languages including Ruby on Rails, Java, Python, C#, C++, and VBA.Experience with cloud services such as AWS and Azure for application deployment.Familiarity with front-end development technologies including HTML, CSS, JavaScript, and React Express.Understanding of RESTful API design principles for effective communication between services.Knowledge of Agile methodologies for efficient project management.Experience with Linux operating systems for development environments.Familiarity with role-based access control (RBAC) principles for secure application design. Join us in creating innovative solutions that make a difference! We look forward to your application if you are passionate about software development and eager to contribute to a collaborative team environment.Job Type: Full-timePay: $89,470.95 - $107,749.96 per yearBenefits:Relocation assistanceWork Location: Remote",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.852829"
  },
  {
    "title": "Software Developer",
    "company": "Prime Healthcare Management Inc",
    "location": "Ontario, CA",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/software-developer-prime-healthcare-management-inc-JV_IC1147122_KO0,18_KE19,50.htm?jl=1009897400873",
    "description": "Prime Healthcare is an award-winning health system headquartered in Ontario, California. Prime Healthcare operates 51 hospitals and has more than 360 outpatient locations in 14 states providing more than 2.5 million patient visits annually. It is one of the nation’s leading health systems with nearly 57,000 employees and physicians. Eighteen of the Prime Healthcare hospitals are members of the Prime Healthcare Foundation, a 501(c)(3) not-for-profit public charity. Prime Healthcare is actively seeking new members to join our corporate team!Responsibilities:This position will have a strong background in programming and software development, with the ability to design, code, test, and maintain high-quality software solutions. Under the minimal direction this position is responsible for analyzing user needs, developing algorithms, troubleshooting, and resolving software issues, and preparing comprehensive technical documentation. The position requires little or no supervision as they design, code, and test the software applications and exercise independent judgement and discretion in carrying out day-to-day functions. Excellent problem-solving skills, attention to detail, and the ability to collaborate effectively with team members and stakeholders are essential. The Software Developer will play a key role in driving innovation and ensuring the delivery of robust, scalable software products. The position also involves developing and designing complex software solutions that enhance the hospital's business operations and care coordination.#LI-AS1Qualifications:Required qualifications:1. Bachelor’s Degree in Computer Science or equivalent degree in engineering required.2. Minimum of two (2) years’ experience in software programming3. Proven experience as a Software Developer, with a strong portfolio of completed projects.4. SQL server, Java, C++, Python, or JavaScript frameworks and Web programming preferred.5. Understands hospital business operations and structure, general requirements in an integrated delivery system, and use of IT applications in the practicing healthcare environment.Pay Transparency:Prime Healthcare offers competitive compensation and a comprehensive benefits package that provides employees the flexibility to tailor benefits according to their individual needs. Our Total Rewards package includes, but is not limited to, paid time off, a 401K retirement plan, medical, dental, and vision coverage, tuition reimbursement, and many more voluntary benefit options. Benefits may vary based on employment status, i.e. full-time, part-time, per diem or temporary. A reasonable compensation estimate for this role, which includes estimated wages, benefits, and other forms of compensation, is $68,640.00 to $160,680.00 on an annualized basis. The exact starting compensation to be offered will be determined at the time of selecting an applicant for hire, in which a wide range of factors will be considered, including but not limited to, skillset, yea... [truncated]",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.853079"
  },
  {
    "title": "Python Developer with Microservices and AWS",
    "company": "Kalpita Technologies",
    "location": "United States",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-with-microservices-and-aws-kalpita-technologies-JV_KO0,43_KE44,64.htm?jl=1009896488962",
    "description": "Posted on: 03-10-2025Experience: 7+ yearsUSAJob ID #1002142Role RequirementsLocation: Plano, TX (Hybrid 3 days a week)Visa Status: USC/GC/GCEAD/H1BThis role is C2C/W2Design and develop full-stack applications using Python (Flask or FastAPI) for backend and Angular 14+ for frontend.Build, integrate, and optimize RESTful APIs for web applications.Develop responsive UIs with reusable Angular components and state management (e.g., NgRx, RxJS).Design and manage data models using PostgreSQL (relational) and DynamoDB (NoSQL).Automate infrastructure provisioning with Terraform for AWS resources.Deploy and manage applications/services in AWS, ensuring scalability, security, and high availability.Implement and maintain CI/CD pipelines, adhering to modern architecture and observability best practices.Write testable, maintainable code with unit, integration, and end-to-end tests.Collaborate in an Agile team to plan, design, and deliver high-quality software features.3–6+ years of professional experience as a Full Stack Developer.Strong backend expertise with Python (Flask or FastAPI).Proficient in Angular 14+, with solid knowledge of components, services, routing, and reactive programming.Strong experience with Terraform, building and maintaining infrastructure as code (IaC) on AWS.Hands-on experience with AWS services (Lambda, API Gateway, S3, CloudWatch, IAM, RDS, ECS/EKS, DynamoDB).Strong understanding of RESTful API design and implementation.Proficiency with SQL (PostgreSQL) and NoSQL (DynamoDB) databases.Familiar with Git workflows, CI/CD pipelines, and Docker/containerization.Knowledge of authentication/authorization protocols (OAuth2, JWT).Strong debugging and troubleshooting skills.Experience with Serverless Framework or AWS SAM.Familiarity with AWS Lambda, SNS/SQS, and CloudFormation.Experience with observability tools (e.g., CloudWatch Logs).Background in test automation and performance testing.Exposure to Agile/Scrum development practices.Bachelor’s degree in Computer Science or related field.",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.853354"
  },
  {
    "title": "Python Developer Advocate",
    "company": "SerpApi",
    "location": "Austin, TX",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-advocate-serpapi-JV_IC1139761_KO0,25_KE26,33.htm?jl=1009897020347",
    "description": "SerpApi is the leading solution to integrate search data into web applications. Our API scrapes search engines, solves CAPTCHAs, and keeps up with changing page layouts in one simple GET request. Our customers include Airbnb, Nvidia, Meta, Shopify, GrubHub and more.We’re looking for a Python Developer Advocate to help expand our reach within the Python community. In this role, you’ll be the bridge between the community and our team—creating useful content, building example projects, maintaining our SDK, and helping SerpApi become the go-to API for scraping search engine results for Python developers around the world.ResponsibilitiesDesign and implement a developer-focused strategy to grow SerpApi’s presence in the Python community.Create engaging content in various formats (blogs, videos, etc.) to educate and captivate our audience.Regularly review customer interactions and issues to gain deeper insights into our product and users' needs.Explore sponsorship and partnership opportunities across various channels.Actively interact with potential users across various platforms to increase user acquisition.Enhance our documentation to improve user engagement and understanding of our product.Explore various tools, including no-code and low-code platforms, that can be integrated with SerpApi.Attend and speak at meetups, conferences, or hackathons to build relationships with the developer community and grow SerpApi’s presence.Solid experience with Python is required. Familiarity with a developer relations role and digital marketing is a plus.PerksSerpApi has been created by engineers for engineers. High compensation, transparency, remote-first, and a high trust environment are at the core of the company. All of these also make a very neurodivergent-friendly work environment. Several of our team members, including our CEO, are on the spectrum. Having a neurodivergent-friendly company is not an afterthought. We welcome talent from all over the world! No matter where you’re based, you can be part of our diverse, remote-first team. For those outside Austin, TX, we typically hire as independent contractors since we don't have an office there.High CompensationWe offer high compensation, bonuses, and career opportunities all across the globe.Competitive WorldwideTotal compensation, including profit shares, averages $232,448 per year per team member worldwide. We pay nearly as much as Google!Profit SharesAll full-time team members receive profit share bonuses. We believe it's important to achieve alignment as a team.Career GrowthInternal career paths, training (courses, conferences, books), and toolings (up to 50% reimbursement for software, hardware, subscriptions, and co-working space).TransparencyA transparent world is a better world. Transparent organizations are more meaningful, connected to reality, and trustworthy.Open BooksWe share our books with all team members. We publish quarterly and annual reports (P&L, expenses).Public RoadmapExcluding security an... [truncated]",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.853662"
  },
  {
    "title": "Python Developer with Microservices",
    "company": "Kalpita Technologies",
    "location": "United States",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-with-microservices-kalpita-technologies-JV_KO0,35_KE36,56.htm?jl=1009896488945",
    "description": "Posted on: 03-10-2025Experience: 7+ yearsUSAJob ID #1002143Role RequirementsLocation: Reston, VA (Hybrid 3 days a week)Visa Status: USC/GC/GCEAD/H1BThis role is C2C/W2Design, develop, and deploy production-grade microservices using modern frameworks and technologies.Implement scalable, resilient, high-performing, optimized, and secure microservices.Lead the software development lifecycle (SDLC) from architecture and design through implementation, testing, and deployment.Collaborate with product managers, architects, and engineers to define and refine technical requirements.Ensure code quality through code reviews, automated testing, and adherence to best practices.Handle and process large datasets across formats such as XML, JSON, and Parquet.Proven experience in microservices design, development, and deployment.Deep experience with AWS services including EC2, ECS, Batch, ALB, API Gateway, Lambda, S3, DynamoDB, EFS, etc.Strong proficiency in Software Development Lifecycle (SDLC).Programming expertise in one or more of the following:Python, Java, Node.js (C++ knowledge is a plus).Hands-on experience with CI platforms such as GitLab.Experience with infrastructure automation using Terraform or other Infrastructure as Code (IaC) tools.Familiarity with coding assistants such as GitHub Copilot (GHCP).Bachelor’s degree in Computer Science, Information Systems, or a related field.10+ years of software development experience across relevant platforms.Solid IT background with experience as a Senior Developer on projects of similar scope and responsibility.Professional certifications (preferred but not mandatory).",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.858626"
  },
  {
    "title": "Urgent Python Developer- Remote",
    "company": "Westlink",
    "location": "Remote",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/urgent-python-developer-remote-westlink-JV_KO0,30_KE31,39.htm?jl=1009882791455",
    "description": "At WestLink, we are committed to building innovative solutions that empower businesses to scale and thrive. Our team values collaboration, creativity, and technical excellence. We are looking for a skilledPython Developerwho shares our passion for technology and problem-solving to join our growing engineering team.Role OverviewAs a Python Developer at WestLink, you will be responsible for designing, developing, and maintaining high-performance applications and services. You will work closely with cross-functional teams—including product managers, designers, and other engineers—to deliver scalable solutions that align with business goals.Key ResponsibilitiesDevelop, test, and deploy efficient and reusable Python code.Collaborate with stakeholders to define technical requirements and translate them into clean, scalable solutions.Integrate with APIs, databases, and third-party services.Maintain and optimize existing applications for performance and scalability.Participate in code reviews, ensuring adherence to best practices and coding standards.Write unit and integration tests to ensure code quality and reliability.Contribute to the continuous improvement of development processes and tools.Required QualificationsBachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience).Strong proficiency inPython 3.xand its frameworks (e.g., Django, Flask, FastAPI).Solid understanding ofobject-oriented programming, design patterns, and best practices.Experience withRESTful APIs, microservices architecture, and asynchronous programming.Proficiency withdatabases(SQL and NoSQL).Familiarity withversion control systems(Git) and CI/CD pipelines.Strong problem-solving skills, with the ability to debug and optimize complex systems.Excellent communication and collaboration skills.Preferred QualificationsExperience withcloud platforms(AWS, GCP, or Azure).Knowledge ofcontainerization and orchestration(Docker, Kubernetes).Familiarity with front-end technologies (JavaScript/TypeScript, React, etc.) is a plus.Understanding ofdata engineering or machine learning workflows.Prior experience in an Agile/Scrum environment.What We OfferCompetitive salary and benefits package.Opportunity to work on impactful projects in a collaborative environment.Professional growth and learning opportunities.A culture that values innovation, ownership, and teamwork.Job Types: Full-time, ContractPay: From $100,000.00 per yearWork Location: Remote",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.862538"
  },
  {
    "title": "Python Developer",
    "company": "Intone Networks",
    "location": "Remote",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-intone-networks-JV_KO0,16_KE17,32.htm?jl=1009872470134",
    "description": "Title: Python Developer/Credit Risk Models/Banking Required Location: Remote But EST or CST candidate only Interview Required: Video",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.863150"
  },
  {
    "title": "Full stack Developer",
    "company": "Jobrok",
    "location": "Remote",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/full-stack-developer-jobrok-JV_KO0,20_KE21,27.htm?jl=1009880892270",
    "description": "We are seeking a talented and versatile Full Stack Developer to join our dynamic team. The ideal candidate will possess a strong foundation in both front-end and back-end development, with expertise in a range of programming languages and frameworks. This role requires a proactive individual who is passionate about software development and application creation, with the ability to work collaboratively in a fast-paced environment.DutiesDesign, develop, and maintain web applications using JavaScript, Java, C#, Python, Ruby on Rails, and other relevant technologies.Implement front-end development using modern frameworks and libraries to create responsive user interfaces.Collaborate with cross-functional teams to define, design, and ship new features efficiently.Develop APIs and integrate third-party services to enhance application functionality.Ensure code quality through unit testing and code reviews.Manage version control using GitHub or SVN for effective collaboration.Work with databases such as MySQL and SQL Server to design efficient data storage solutions.Deploy applications on cloud platforms like AWS or Azure while ensuring optimal performance and security.Troubleshoot and resolve issues across the full stack of technology.QualificationsProficiency in programming languages such as JavaScript, Java, C#, Python, C++, Ruby on Rails, and .NET.Strong understanding of front-end development principles and experience with HTML, CSS, and JavaScript frameworks.Familiarity with RESTful APIs and application integration techniques.Experience with database management systems including MySQL and SQL Server.Knowledge of version control systems like Git and SVN is essential.Understanding of cloud services (AWS or Azure) is highly desirable.Familiarity with Linux environments is an advantage.Experience with VBA for automation tasks is a plus.Excellent problem-solving skills and attention to detail are required. If you are an innovative thinker who thrives in a collaborative environment and is eager to contribute to exciting projects, we would love to hear from you!Job Type: Full-timePay: $103,841.20 - $125,056.08 per yearWork Location: Remote",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.863713"
  },
  {
    "title": "Python Developer with TAS, OCP",
    "company": "Donato Technologies Inc",
    "location": "Charlotte, NC",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/python-developer-with-tas-ocp-donato-technologies-inc-JV_IC1138644_KO0,29_KE30,53.htm?jl=1009894427750",
    "description": "Description not available",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.865027"
  },
  {
    "title": "Senior Python Developer",
    "company": "Placify Technologies Private Limited",
    "location": "Dallas, TX",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/senior-python-developer-placify-technologies-private-limited-JV_IC1139977_KO0,23_KE24,60.htm?jl=1009895541442",
    "description": "Role: Python EngineerLocation: Westlake, TX (Onsite, 50% Hybrid) / (onsite every other week)Must be local to Dallas, TXDuration: 5+ MonthsJob Description:Roles and Responsibilities:Design and develop Python scripts for performance automation across Windows and macOS platformsBuild and maintain desktop automation workflows using PyAutoGUI, PyWinAuto, and ATmacOS, including refactoring existing automationJob Type: ContractPay: $60.00 - $65.00 per hourAbility to Commute:Dallas, TX 75204 (Preferred)Ability to Relocate:Dallas, TX 75204: Relocate before starting work (Preferred)Work Location: In person",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.873514"
  },
  {
    "title": "Senior .NET Developer with Python",
    "company": "Infonix",
    "location": "Westlake, TX",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/senior-net-developer-with-python-infonix-JV_IC1161600_KO0,32_KE33,40.htm?jl=1009897323470",
    "description": "Job OverviewWe are seeking a highly skilled Senior .NET Developer to join our dynamic team. The ideal candidate will have extensive experience in software development, particularly with .NET technologies and Python Scripting, and will be responsible for designing, developing, and maintaining high-quality applications. This role requires a strong understanding of both front-end and back-end development, as well as the ability to work collaboratively in an Agile environment. This role requires both strong .NET development and Python skills.ResponsibilitiesDesign, develop, and implement robust applications using ASP.NET and C#Collaborate with cross-functional teams to define, design, and ship new featuresMaintain and improve existing applications by troubleshooting and debugging issuesDevelop front-end components using frameworks such as React or AngularCreate RESTful APIs and integrate with various web servicesUtilize databases such as SQL Server, MySQL, or MongoDB for data storage solutionsImplement unit testing to ensure code quality and reliabilityParticipate in code reviews to maintain high standards of software qualityContribute to all phases of the software development lifecycle (SDLC)Stay up-to-date with emerging technologies and industry trendsSkillsProficient in .NET framework and C# programming language together with Python Scripting.Strong experience with web development technologies including HTML, CSS, JavaScript, and AJAXFamiliarity with front-end frameworks such as React, Angular, or BootstrapKnowledge of database design and management using SQL Server, PostgreSQL, or MySQLExperience with cloud services like AWS or Azure for application deploymentUnderstanding of microservices architecture and RESTful API developmentAbility to work with version control systems such as Git or SVNFamiliarity with Agile methodologies and CI/CD practicesStrong debugging skills and experience with tools like Visual Studio or EclipseExcellent problem-solving abilities and attention to detailJoin us in creating innovative solutions that drive business success while enhancing your professional growth in a collaborative environment.Job Type: ContractPay: $55.00 - $60.00 per hourExpected hours: 40 per weekWork Location: In person",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.875057"
  },
  {
    "title": "Django/Python Developer",
    "company": "Resource Innovations",
    "location": "Chicago, IL",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/django-python-developer-resource-innovations-JV_IC1128808_KO0,23_KE24,44.htm?jl=1009883435012",
    "description": "Resource Innovations is seeking and experiencedDjango/Python Developerto join our growing Customer Engagement engineering team. Our Customer Engagement engineering team develops personalized digital platforms to support the delivery of E-Commerce and retail programs. As a Django/Python Developer, you will work closely with the Lead Engineer on further developing, maintaining, and enhancing Commerce Manager, the practice's operating system, which is built using Django.Resource Innovations(RI) is awomen-led energy transformation firmfocused on impact. Building on our expertise in energy efficiency, we continually expand our portfolio of clean energy solutions to guide utilities through increasingly complex and interconnected challenges. Load flexibility. Electrification. Carbon reduction. With every step, we’re leading the charge to power change.Duties and Responsibilities:Contribute to the development, maintenance, and enhancement of the organization's Commerce Manager software, which powers the core E-Commerce and retail product offerings of the Customer Engagement practice.Collaborate with team members (e.g., project delivery staff, senior developers) to scope and design new features and applications used by our delivery staff to implement utility energy efficiency programs.Write Python code within a Django web framework securely and efficiently. This includes working with models, model admins, custom views, and custom Django Ninja API routes.Work efficiently with Git, GitHub, Heroku, and other components of our ecosystem.Ensure data security/privacy and protocols are established and followed based on client and company requirements.Make recommendations for improvements to processes and technologies.Document code and features in a library system, both from a developer perspective to help other developers replicate where needed and from a user perspective to help program delivery staff and users know how features work.Other duties as assigned.Requirements5+ years of experience writing code.Significant comfort level with the foundations of Python programming, intermediate level or above.Must have familiarity with Django and/or Flask.Ability to work independently once direction is set and to ask questions to avoid being stuck for extended periods.Ability to work quickly, both in grasping concepts and in writing and testing code.Ability to work in small, focused bursts on disparate tasks routinely as opposed to longer, singular tasks. This requiresquick ramp up on new tasks.Git or other version control experience.Django web framework experience.Experience building and deploying APIs.Preferred QualificationsA bachelor’s degree in computer science or comparable work experience.Experience with Heroku, AWS, Jira, and GitHubExperience with systems design fundamentals such as model architecture, Postgres schema, and more.Experience with developing custom functionality within the Django admin.BenefitsAbout Resource InnovationsResource Innovations (RI) is a... [truncated]",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.875463"
  },
  {
    "title": "Senior Python Developer",
    "company": "Agama Solutions",
    "location": "Remote",
    "salary": "N/A",
    "url": "https://www.glassdoor.com/job-listing/senior-python-developer-agama-solutions-JV_KO0,23_KE24,39.htm?jl=1009883618680",
    "description": "Required Skills & Experience7+ years of fullstack development experience(10+ preferred).Strong hands-on experience with:PythonReactPostgres&SQLHealthcare industry experience within the last 3 years(mandatory).Excellent communication and collaboration skills.Proven ability to work independently in a remote environment.Stable career history (no short-term projects).Job Type: Full-timePay: $145,000.00 - $150,000.00 per yearApplication Question(s):Let me know your VisaWork Location: Remote",
    "source": "Glassdoor",
    "scraped_at": "2025-10-05T01:48:59.876228"
  }
]